# <font color=Red> 1. Importing Packages , Reading Files </font>

In [ ]:
Stop Auto Save

In [22]:
%autosave 0

Autosave disabled

Importing Data

import warnings
warnings.filterwarnings('ignore')

import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
import seaborn as sns


<font color=Red> Display all columns </font>

pd.set_option('display.max_columns', None)

Understanding Operating system
Display all columns

import os
os.getcwd()


<font color=Black> Reading different type of file </font>

pd.read_csv(filename)                                         #to read csv file

pd.read_table(filename)                                       #to read delimited text file

pd.read_excel(file)                                           #to read excel file




pd.read_json(json_string)                                     #Read from json formatted string, url or file

pd.read_html(url)                                             #parses an html url and extracts tables to a data frames

pd.read_clipboard()                                           #Read Clipboard

<font color=Orange> Reading Data From SQL </font>

import pandas as pd
import pyodbc
sql_conn = pyodbc.connect('DRIVER={ODBC Driver 13 for SQL Server};
                            SERVER=SQLSERVER2017;
                            DATABASE=Adventureworks;
                            Trusted_Connection=yes') 
query = "SELECT [BusinessEntityID],[FirstName],[LastName],
                 [PostalCode],[City] FROM [Sales].[vSalesPerson]"
df = pd.read_sql(query, sql_conn)

df.head(3)

# <font color=Red> 2. Exploratory Data Analysis (EDA) </font>

df.head()
df.tail()
df.shape()                                                                   #No.of rows and columns

df.info()                                                                    #Header, no. of rows, type and total null in column

df.describe()                                                                #Statistical info. of data

df['column'].value_counts()                                                  #view unique values and counts

df.dtypes                                                                    #Print datatype of all columns

df[df.duplicated()])                                                         #Print all duplicate instances

df.drop_duplicates()                                                         #Delete all duplicates instances

df['Age'] = pd.cut(df['Age'], bins=[20, 29, 39, 49,59,69,79])                #Convert a numerical column into bins

Data Cleaning

<font color=Brown> Handling Null Values </font>

df.isnull().sum()                                                   #to check null in all columns

df.dropna()                                                         #Drop all rows that contain null

df.dropna(axis=1)                                                   #Drop all columns that contain null


df.drop(['ID'],axis=1)                                              #Drop column with name ID


df.drop(df.index[[2,4]])                                            #Drop 2nd and 4th Rows from Dataframe


df.fillna(x)                                                        #Replace all null values with x

df['column'].fillna(df['column'].mean())                            #Replace column null with mean of that column

<font color=Green> Changing Type, Name of Column </font>

df['column'].astype(float)                                                      #Convert the datatype to float

df.rename(columns={'old_name':'new_name'})                                      #Selective renaming

df.set_index('column_xyz')                                                      #make column column_xyz as index column

df['Column'] = df.index                                                         #Create a new column from index

<font color=Red> Changing column in datetime format </font>

dataset['datetime']=pd.to_datetime(dataset['datatime'])

<font color=Orange> Replace Values in Column </font>

df['column'].replace(1,x)                             #replace all 1 with x

df['column'].replcae([1,3],[x,y])                     #replace all 1 with x and all 3 with y

<font color=Blue> Selecting Columns with Datatypes </font>

quantitative=df.select_dtypes('int64')                #Select all columns with datatype int

qualitative=df.select_dtypes('object')                #Select all columns with datatype object

<font color=Red> Statistical Analysis </font>

df.describe()                #Statistical info. of all data

df.mean()                    #mean of all columns

df.corr()                    #correlation among columns
sns.heatmap(df.corr())

df.count()                   #No. of non null values in each column

df.max()                     #higher value in each column

df.min()

df.median()

df.std()

df.var(

<font color=Black> Filtering or Selcting Rows, Columns </font>

df[col1]                                                         #Return a particular column col1 as dataframe
df[[col1,col2]]                                                  #Return columns as new dataframe
dataset.iloc[4]                                                  #Returns detail of 5th Row 
dataset.iloc[2:4]                                                #Retuens row 1st, 2nd and 3rd row
dataset.iloc[1:3,3:5]                                            #Returns 1, 2 row and in that 3,4 columns
dataset.iloc[0,0]                                                #Returns 1st element of 1st column

<font color=Brown> Filtering, Sorting, Grouping, Pivot </font>

df[df[col1]>0.5]
df[(df[col1]>0.5) & (df[col1]<0.7)]


df.sort_values(col1)                                       #Sort values by col1 in ascending order
df.sort_values(col1, ascending=False)                      #in descending order
df.sort_values([col1,col2],ascending==[True,False])        #1st by ascending column1 and then by descending of column2


x=df.groupby('regiment').sum() 
x=df.groupby('regiment').mean()


df['column'].value_counts()


df.pivot_table(index=col1,values=[col1,col3],aggfunc=mean) #Group by col1 and calculates mean of col2, col3
import numpy
pd.pivot_table(df,values='Kms_Driven',index=['Year','Fuel_Type'],aggfunc=np.sum)

# <font color=Red> Power Transform or Box Cox </font>


<font color=Red> Convert a column into normal / Gaussian distribution </font>

from numpy import exp
from scipy.stats import boxcox
data = exp(data)
data = boxcox(data, 0) #0 is value of lambda

lambda = -1. is a reciprocal transform.
lambda = -0.5 is a reciprocal square root transform.
lambda = 0.0 is a log transform.
lambda = 0.5 is a square root transform.
lambda = 1.0 is no transform.

In [2]:
from scipy.stats import mode
mode(["A","B","A","B","A"])

ModeResult(mode=array(['A'], dtype='<U1'), count=array([3]))

# Join or Combine

<font color=Blue> Append, Concat, Merge, Join </font>

df1.append(df2)                     #Add the rows in df1 to the end of df2 (columns should be identical)


pd.concat([df1,df2],axis=1)         #Add the columns in df1 to the end of df2 (Rows should be identical)

df1.join(df2,on=col1,how='inner')
#SQL style joins the column in df1 with columns on df2 where the rows for cols have identical values
#how can be one of 'left', 'right','outer','inner'

# CROSSTAB

In [3]:
import pandas as pd
raw_data={'regiment':['A','A','A','A','B','B','B','B','C','C','C','C'],
          'company':['X','X','Y','Y','X','X','Y','Y','X','X','Y','Y'],
          'experience':['Vetean','rookie','Vetean','rookie','Vetean','rookie','Vetean'
                        ,'rookie','Vetean','rookie','Vetean','rookie'],
          'name':['Miller','Jacobson','Ali','Milner','Cooze','Jacon','Ryaner','Sone','Sloan','Piger',
                 'Riani','Ali'],
          'preTestScore':[4,24,31,2,3,4,24,31,2,3,2,3],
          'postTestScore':[25,94,57,62,70,25,94,57,62,70,62,70]}
df=pd.DataFrame(raw_data,columns=['regiment','company','experience','name','preTestScore','postTestScore'])

In [4]:
df

   regiment company experience      name  preTestScore  postTestScore
0         A       X     Vetean    Miller             4             25
1         A       X     rookie  Jacobson            24             94
2         A       Y     Vetean       Ali            31             57
3         A       Y     rookie    Milner             2             62
4         B       X     Vetean     Cooze             3             70
5         B       X     rookie     Jacon             4             25
6         B       Y     Vetean    Ryaner            24             94
7         B       Y     rookie      Sone            31             57
8         C       X     Vetean     Sloan             2             62
9         C       X     rookie     Piger             3             70
10        C       Y     Vetean     Riani             2             62
11        C       Y     rookie       Ali             3             70

In [5]:
#Counting the no. of observation by regiment and category
pd.crosstab(df.regiment,df.company,margins=True)

company   X  Y  All
regiment
A         2  2    4
B         2  2    4
C         2  2    4
All       6  6   12

In [6]:
#create a crosstab of the no. of rookie and vetean cavalry and infantry soldiers per regiment
pd.crosstab([df.company,df.experience],df.regiment,margins=True)

regiment            A  B  C  All
company experience
X       Vetean      1  1  1    3
        rookie      1  1  1    3
Y       Vetean      1  1  1    3
        rookie      1  1  1    3
All                 4  4  4   12


# <font color=Red> Important : Append, Merge, Concat </font>

In [7]:
a = [1,2,3,4,5]
b = [6,7,8,9]
a.append(b)
print(a)

[1, 2, 3, 4, 5, [6, 7, 8, 9]]

In [8]:
a = [1,2,3,4,5]
b = [6,7,8,9]
a.extend(b)
print(a)

[1, 2, 3, 4, 5, 6, 7, 8, 9]

In [9]:
import numpy as np
import pandas as pd
train_set = np.array([1, 2, 3])
test_set = np.array([[0, 1, 2], [1, 2, 3]])

In [10]:
np.vstack([train_set, test_set])

array([[1, 2, 3],
       [0, 1, 2],
       [1, 2, 3]])

In [11]:
df1=pd.DataFrame(train_set)
df2=pd.DataFrame(test_set)

In [12]:
df1

   0
0  1
1  2
2  3

In [13]:
df2

   0  1  2
0  0  1  2
1  1  2  3

In [14]:
df1.append(df2)

   0    1    2
0  1  NaN  NaN
1  2  NaN  NaN
2  3  NaN  NaN
0  0  1.0  2.0
1  1  2.0  3.0

In [15]:
pd.concat([df1,df2])

   0    1    2
0  1  NaN  NaN
1  2  NaN  NaN
2  3  NaN  NaN
0  0  1.0  2.0
1  1  2.0  3.0

In [16]:
pd.concat([df1,df2],axis=1)

   0    0    1    2
0  1  0.0  1.0  2.0
1  2  1.0  2.0  3.0
2  3  NaN  NaN  NaN

In [17]:
import pandas as pd
df1 = pd.DataFrame({'employee': ['Bob', 'Jake', 'Lisa', 'Sue'],
                    'group': ['Accounting', 'Engineering', 'Engineering', 'HR']})
df2 = pd.DataFrame({'employee': ['Lisa', 'Bob', 'Jake', 'Sue'],
                    'hire_date': [2004, 2008, 2012, 2014]})
display(df1, df2)

  employee        group
0      Bob   Accounting
1     Jake  Engineering
2     Lisa  Engineering
3      Sue           HR

  employee  hire_date
0     Lisa       2004
1      Bob       2008
2     Jake       2012
3      Sue       2014

In [18]:
df3 = pd.merge(df1, df2)
df3

  employee        group  hire_date
0      Bob   Accounting       2008
1     Jake  Engineering       2012
2     Lisa  Engineering       2004
3      Sue           HR       2014

In [28]:
print("df1")
df1 = pd.DataFrame({'lkey': ['foo', 'bar', 'baz', 'foo'],'value': [1, 2, 3, 5]})
print(df1)
print("df2")
df2 = pd.DataFrame({'rkey': ['foo', 'bar', 'baz', 'foo'],'value': [5, 6, 7, 8]})
print(df2)

df1
  lkey  value
0  foo      1
1  bar      2
2  baz      3
3  foo      5
df2
  rkey  value
0  foo      5
1  bar      6
2  baz      7
3  foo      8

In [29]:
df1.merge(df2, left_on='lkey', right_on='rkey')

  lkey  value_x rkey  value_y
0  foo        1  foo        5
1  foo        1  foo        8
2  foo        5  foo        5
3  foo        5  foo        8
4  bar        2  bar        6
5  baz        3  baz        7

In [35]:
df1.merge(df2, how='inner')

  lkey  value rkey
0  foo      5  foo

In [34]:
df1.merge(df2, how='left')

  lkey  value rkey
0  foo      1  NaN
1  bar      2  NaN
2  baz      3  NaN
3  foo      5  foo

In [36]:
df1.merge(df2, how='right')

  lkey  value rkey
0  foo      5  foo
1  NaN      6  bar
2  NaN      7  baz
3  NaN      8  foo

# <font color=Red> To Find importance of Columns _ Dimensionality Reduction </font>

from sklearn.ensemble import ExtraTreesRegressor
model=ExtraTreesRegressor()
model.fit(X,y)
print(model.feature_importances_)